artillery_test.yml
config:
  target: 'http://192.168.1.159:3000'
  phases:
    - duration: 30
      arrivalRate: 100
  payload:
    -
      path: "testUserId.csv"
      skipHeader: true
      fields:
        - "userId"
  defaults:
    headers:
scenarios:
  - name: "get User Post"
    flow:
      - get:
          url: "/getUser/{{ userId }}"
      - get:
          url: "/getUserPosts/{{ userId }}"
          capture:
            json: "$.data[0].id"
            as: "postId"
      - get:
          url: "/getPostComments/{{ postId }}"