artillery_test.yml
config:
  target: 'http://test2.myeking.com'
#  target: 'http://54.199.227.242:3000'
  phases:
    - duration: 60
      arrivalRate: 300
  payload:
    -
      path: "testUserId.csv"
      skipHeader: true
      fields:
        - "userId"
  defaults:
    headers:
scenarios:
  - name: "get User Post"
    weight: 80
    flow:
      - get:
          url: "/getUser/{{ userId }}"
      - get:
          url: "/getUserPosts/{{ userId }}"
          capture:
            json: "$.data[0].id"
            as: "postId"
      - get:
          url: "/getPostComments/{{ postId }}"
  - name: "add comment"
    weight: 15
    flow:
      - get:
          url: "/addComment/{{ userId }}/{{ postId }}"
  - name: "add post"
    weight: 5
    flow:
      - get:
          url: "/addPost/{{ userId }}"